insert into regions (name_ka) values
  ('თბილისი'), ('აჭარა'), ('იმერეთი'), ('კახეთი'), ('ქვემო ქართლი'),
  ('სამეგრელო-ზემო სვანეთი'), ('სამცხე-ჯავახეთი'), ('გურია'),
  ('მცხეთა-მთიანეთი'), ('რაჭა-ლეჩხუმი და ქვემო სვანეთი'), ('შიდა ქართლი');

insert into cities (region_id, name_ka)
select r.id, c.name from regions r
join (values
  ('თბილისი', 'თბილისი'),
  ('აჭარა', 'ბათუმი'), ('აჭარა', 'ქობულეთი'), ('აჭარა', 'ხულო'),
  ('იმერეთი', 'ქუთაისი'), ('იმერეთი', 'ზესტაფონი'), ('იმერეთი', 'სამტრედია'), ('იმერეთი', 'ჭიათურა'),
  ('კახეთი', 'თელავი'), ('კახეთი', 'გურჯაანი'), ('კახეთი', 'სიღნაღი'), ('კახეთი', 'ყვარელი'),
  ('ქვემო ქართლი', 'რუსთავი'), ('ქვემო ქართლი', 'მარნეული'), ('ქვემო ქართლი', 'ბოლნისი'), ('ქვემო ქართლი', 'გარდაბანი'),
  ('სამეგრელო-ზემო სვანეთი', 'ზუგდიდი'), ('სამეგრელო-ზემო სვანეთი', 'ფოთი'), ('სამეგრელო-ზემო სვანეთი', 'სენაკი'), ('სამეგრელო-ზემო სვანეთი', 'მესტია'),
  ('სამცხე-ჯავახეთი', 'ახალციხე'), ('სამცხე-ჯავახეთი', 'ბორჯომი'), ('სამცხე-ჯავახეთი', 'ახალქალაქი'),
  ('გურია', 'ოზურგეთი'), ('გურია', 'ლანჩხუთი'), ('გურია', 'ჩოხატაური'),
  ('მცხეთა-მთიანეთი', 'მცხეთა'), ('მცხეთა-მთიანეთი', 'დუშეთი'), ('მცხეთა-მთიანეთი', 'სტეფანწმინდა'),
  ('რაჭა-ლეჩხუმი და ქვემო სვანეთი', 'ამბროლაური'), ('რაჭა-ლეჩხუმი და ქვემო სვანეთი', 'ონი'), ('რაჭა-ლეჩხუმი და ქვემო სვანეთი', 'ცაგერი'), ('რაჭა-ლეჩხუმი და ქვემო სვანეთი', 'ლენტეხი'),
  ('შიდა ქართლი', 'გორი'), ('შიდა ქართლი', 'ხაშური'), ('შიდა ქართლი', 'ქარელი'), ('შიდა ქართლი', 'კასპი')
) as c(region, name) on r.name_ka = c.region;
